//##################################### FUNCIONES EN BASE DE DATOS ######################################//
const { actualizarTipoVerificadodb } = require('../../../../modelos/empresas/actualizar/interfaz/actualizar.js');
//#######################################################################################################//

//############################################# DESARROLLO ##############################################//
const actualizarTipo = (req, res) => {

    //-- Variables y Ctes.
    let id = req.params.id;
    const tipo = req.body.tipo;
    //-- Llamada a función.
    actualizarTipoVerificadodb(id, tipo, res);
}
//#######################################################################################################//

//########################################### PUNTO DE UNIÓN ############################################//
module.exports = actualizarTipo;
//#######################################################################################################//